upgrading-checklist.org
-*- mode: org; fill-column: 78 -*-
#+STARTUP: showall
#+STARTUP: lognotedone lognotestate
#+OPTIONS: H:4 toc:2
#+TITLE:  Policy checklist for upgrading your packages
#+AUTHOR: Bill Allombert, Josip Rodin, Julian Gilbey, Russ Allbery, and Manoj Srivastava
#+EMAIL: srivasta@debian.org
#+OPTIONS:   H:3 num:nil toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t TeX:t LaTeX:nil skip:t d:nil tags:not-in-toc
#+LINK_HOME: http://wiki.debian.org/Teams/Policy
#+LINK_UP: http://www.debian.org/

\usepackage{landscape}

\setlength{\oddsidemargin}{0in}		% default=0in
\setlength{\textwidth}{9in}		% default=9in

\setlength{\columnsep}{0.5in}		% default=10pt
\setlength{\columnseprule}{1pt}		% default=0pt (no line)

\setlength{\textheight}{5.85in}		% default=5.15in
\setlength{\topmargin}{-0.15in}		% default=0.20in
\setlength{\headsep}{0.25in}		% default=0.35in

\setlength{\parskip}{1.2ex}
\setlength{\parindent}{0mm}
\pagestyle{empty}

\setlength{\headheight}{0pt}
\setlength{\headsep}{0pt}
\setlength{\footskip}{5pt}
\setlength{\textheight}{9.0in}
\setlength{\textwidth}{6.5in}

** About the checklist

The checklist below has been created to simplify the upgrading process
of old packages.  Note that this list is not "official"; it simply
gives an indication of what has changed and whether you are likely to
need to make changes to your package in light of this.  If you have
doubts about a certain topic, if you need more details, or if you
think some other package does not comply with policy, please refer to
the Policy Manual itself.  All of the changes from version 3.0.0
onwards indicate which section of the Policy Manual discusses the
issue: [3.4] means section 3.4.  The section numbering changed when
the packaging manual was incorporated into policy; the section numbers
used below refer to the current version.

Here is how the check list works: Check which policy version your
package was checked against last (indicated in the "Standards-Version"
field of the source package).  Then move upwards until the top and
check which of the items on the list might concern your package.  Note
which sections of policy discuss this, and then check out the Policy
Manual for details.  If you are upgrading from Policy version < 2.5.0,
it may be easier to check through the whole of policy instead of
picking your way through this list.

** The checklist

*** 3.8.3.0

  Released Aug, 2009.
+ *4.9* : Add DEB\_*\_ARCH\_CPU and DEB\_*\_ARCH\_OS variables and
  recommend them over GNU-style variables for that information.
+ *5.6.8*: Source package Architecture fields may contain /all/ in
  combination with other architectures.  Clarify when /all/ and /any/
  may be used in different versions of the field.
+ *5.6.14* : The Debian archive software does not support uploading
  to multiple distributions with one \*.changes file.
+ *5.6.19* : The Binary field may span multiple lines. 
+ *10.2* : Remove the permission for shared library packages to
  install libraries in a non-standard location and modify ld.so.conf.
  Packages should either be installed in a standard library directory
  or packages using them should be built with RPATH.
+ *11.8.7* : Clarify installation directories for X programs and
  remove the requirement to pre-depend on x11-common before installing
  into /usr/include/X11 and /usr/lib/X11.
+ *12.1* : Remove the requirement that all characters in a manual
  page be representable in the legacy encoding for that language.
+ *12.1* : Localized man pages should either be kept up-to-date with
  the original version or warn that they're not up-to-date, either
  with warning text or by showing missing or changed portions in the
  original language.
+ *12.2* : install-info is now handled via triggers so packages no
  longer need to invoke it in maintainer scripts.  Info documents
  should now have directory sections and entries in the document.
  Packages containing info documents should add a dependency to
  support partial upgrades.
+ *perl* : The requirement for Perl modules to have a versioned
  Depend and Build-Depend on perl >= 5.6.0-16 has been removed.

*** 3.8.2.0

Released Jun 2009.

+ *2.4*: The list of archive sections has been significantly expanded.  See
  [[http://lists.debian.org/debian-devel-announce/2009/03/msg00010.html]]
  for the list of new sections and rules for how to categorize
  packages.                                                 
+ *3.9.1*: All packages must use debconf or equivalent for user prompting,
  though essential packages or their dependencies may also fall
  back on other methods.                                    
+ *5.6.1*: The requirements for source package names are now explicitly
  spelled out. 
+ *9.1*: Legacy XFree86 servers no longer get a special exception from the
  FHS permitting /etc/X11/XF86Config-4. 
+ *9.1.3*: Removed obsolete dependency requirements for packages that use
  /var/mail. 
+ *11.8.5*: Speedo fonts are now deprecated.  The X backend was disabled
  starting in lenny.                                        
+ *12.5*: The GNU Free Documentation License version 1.3 is included in
  common-licenses and should be referenced from there.      

*** 3.8.1.0

Released  Mar 2009.

+ *3.8*: Care should be taken when adding functionality to essential and
  such additions create an obligation to support that functionality
  in essential forever unless significant work is done.     
+ *4.4*: Changelog files must be encoded in UTF-8.                 
+ *4.4*: Tighten some format requirements for changelog files from a should
  to a must.                                                
+ *4.4.1*: Remove alternative changelog formats.  Debian only supports one
  changelog format for the Debian Archive.                  
+ *4.9.1*: New nocheck option for DEB\_BUILD\_OPTIONS indicating any build-time
  test suite provided by the package should not be run.     
+ *5.1*: All control files must be encoded in UTF-8.               
+ *5.2*: debian/control allows comment lines starting with # with no
  preceding whitespace.                                     
+ *9.3*: Init scripts ending in .sh are not handled specially.  They are not
  sourced and are not guaranteed to be run by /bin/sh regardless of
  the #! line.  This brings Policy in line with the long-standing
  behavior of the init system in Debian.                    
+ *9.3.2*: The start action of an init script must exit successfully and not
  start the daemon again if it's already running.           
+ *9.3.2*: /var/run and /var/lock may be mounted as temporary filesystems, and
  init scripts must therefore create any necessary subdirectories
  dynamically.                                              
+ *10.4*: /bin/sh scripts may assume that local can take multiple variable
  arguments and supports assignment.                        
+ *11.6*: User mailboxes may be mode 600 and owned by the user rather than
  mode 660, owned by user, and group mail.                  

