upgrading-checklist.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<div style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="http://www.debian.org/"> UP </a>
 |
 <a accesskey="H" href="http://wiki.debian.org/Teams/Policy"> HOME </a>
</div>

<title>Policy checklist for upgrading your packages</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2009-11-12 17:10:20 PST"/>
<meta name="author" content="Bill Allombert, Josip Rodin, Julian Gilbey, Russ Allbery, and Manoj Srivastava"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>


</head>
<body>
<div id="content">
<h1 class="title">Policy checklist for upgrading your packages</h1>


<div id="outline-container-1" class="outline-3">
<h3 id="sec-1">About the checklist </h3>
<div class="outline-text-3" id="text-1">


<p>
The checklist below has been created to simplify the upgrading process
of old packages.  Note that this list is not "official"; it simply
gives an indication of what has changed and whether you are likely to
need to make changes to your package in light of this.  If you have
doubts about a certain topic, if you need more details, or if you
think some other package does not comply with policy, please refer to
the Policy Manual itself.  All of the changes from version 3.0.0
onwards indicate which section of the Policy Manual discusses the
issue: [3.4] means section 3.4.  The section numbering changed when
the packaging manual was incorporated into policy; the section numbers
used below refer to the current version.
</p>
<p>
Here is how the check list works: Check which policy version your
package was checked against last (indicated in the "Standards-Version"
field of the source package).  Then move upwards until the top and
check which of the items on the list might concern your package.  Note
which sections of policy discuss this, and then check out the Policy
Manual for details.  If you are upgrading from Policy version &lt; 2.5.0,
it may be easier to check through the whole of policy instead of
picking your way through this list.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-3">
<h3 id="sec-2">The checklist </h3>
<div class="outline-text-3" id="text-2">



</div>

<div id="outline-container-2.1" class="outline-4">
<h4 id="sec-2.1"><a name="v3.8.4.0" id="v3.8.4.0"></a>3.8.4.0 </h4>
<div class="outline-text-4" id="text-2.1">


<p>
Unreleased.
</p>
<ul>
<li>
<b>10.6</b> : Explicitly state that packages may not contain named pipes and
should instead create them in postinst and remove them in prerm or postrm.

</li>
</ul>
</div>

</div>

<div id="outline-container-2.2" class="outline-4">
<h4 id="sec-2.2"><a name="v3.8.3.0" id="v3.8.3.0"></a>3.8.3.0 </h4>
<div class="outline-text-4" id="text-2.2">


<p>
Released Aug 2009.
</p>
<ul>
<li>
<b>4.9</b> : Add DEB_*_ARCH_CPU and DEB_*_ARCH_OS variables and
recommend them over GNU-style variables for that information.
</li>
<li>
<b>5.6.8</b>: Source package Architecture fields may contain <i>all</i> in
combination with other architectures.  Clarify when <i>all</i> and <i>any</i>
may be used in different versions of the field.
</li>
<li>
<b>5.6.14</b> : The Debian archive software does not support uploading
to multiple distributions with one \*.changes file.
</li>
<li>
<b>5.6.19</b> : The Binary field may span multiple lines. 
</li>
<li>
<b>10.2</b> : Remove the permission for shared library packages to
install libraries in a non-standard location and modify ld.so.conf.
Packages should either be installed in a standard library directory
or packages using them should be built with RPATH.
</li>
<li>
<b>11.8.7</b> : Clarify installation directories for X programs and
remove the requirement to pre-depend on x11-common before installing
into /usr/include/X11 and /usr/lib/X11.
</li>
<li>
<b>12.1</b> : Remove the requirement that all characters in a manual
page be representable in the legacy encoding for that language.
</li>
<li>
<b>12.1</b> : Localized man pages should either be kept up-to-date with
the original version or warn that they're not up-to-date, either
with warning text or by showing missing or changed portions in the
original language.
</li>
<li>
<b>12.2</b> : install-info is now handled via triggers so packages no
longer need to invoke it in maintainer scripts.  Info documents
should now have directory sections and entries in the document.
Packages containing info documents should add a dependency to
support partial upgrades.
</li>
<li>
<b>perl</b> : The requirement for Perl modules to have a versioned
Depend and Build-Depend on perl &gt;= 5.6.0-16 has been removed.

</li>
</ul>
</div>

</div>

<div id="outline-container-2.3" class="outline-4">
<h4 id="sec-2.3"><a name="v3.8.2.0" id="v3.8.2.0"></a>3.8.2.0 </h4>
<div class="outline-text-4" id="text-2.3">


<p>
Released Jun 2009.
</p>
<ul>
<li>
<b>2.4</b>: The list of archive sections has been significantly expanded.  See
<a href="http://lists.debian.org/debian-devel-announce/2009/03/msg00010.html">http://lists.debian.org/debian-devel-announce/2009/03/msg00010.html</a>
for the list of new sections and rules for how to categorize
packages.                                                 
</li>
<li>
<b>3.9.1</b>: All packages must use debconf or equivalent for user prompting,
though essential packages or their dependencies may also fall
back on other methods.                                    
</li>
<li>
<b>5.6.1</b>: The requirements for source package names are now explicitly
spelled out. 
</li>
<li>
<b>9.1</b>: Legacy XFree86 servers no longer get a special exception from the
FHS permitting /etc/X11/XF86Config-4. 
</li>
<li>
<b>9.1.3</b>: Removed obsolete dependency requirements for packages that use
/var/mail. 
</li>
<li>
<b>11.8.5</b>: Speedo fonts are now deprecated.  The X backend was disabled
starting in lenny.                                        
</li>
<li>
<b>12.5</b>: The GNU Free Documentation License version 1.3 is included in
common-licenses and should be referenced from there.      

</li>
</ul>
</div>

</div>

<div id="outline-container-2.4" class="outline-4">
<h4 id="sec-2.4"><a name="v3.8.1.0" id="v3.8.1.0"></a>3.8.1.0 </h4>
<div class="outline-text-4" id="text-2.4">


<p>
Released  Mar 2009.
</p>
<ul>
<li>
<b>3.8</b>: Care should be taken when adding functionality to essential and
such additions create an obligation to support that functionality
in essential forever unless significant work is done.     
</li>
<li>
<b>4.4</b>: Changelog files must be encoded in UTF-8.                 
</li>
<li>
<b>4.4</b>: Tighten some format requirements for changelog files from a should
to a must.                                                
</li>
<li>
<b>4.4.1</b>: Remove alternative changelog formats.  Debian only supports one
changelog format for the Debian Archive.                  
</li>
<li>
<b>4.9.1</b>: New nocheck option for DEB_BUILD_OPTIONS indicating any build-time
test suite provided by the package should not be run.     
</li>
<li>
<b>5.1</b>: All control files must be encoded in UTF-8.               
</li>
<li>
<b>5.2</b>: debian/control allows comment lines starting with # with no
preceding whitespace.                                     
</li>
<li>
<b>9.3</b>: Init scripts ending in .sh are not handled specially.  They are not
sourced and are not guaranteed to be run by /bin/sh regardless of
the #! line.  This brings Policy in line with the long-standing
behavior of the init system in Debian.                    
</li>
<li>
<b>9.3.2</b>: The start action of an init script must exit successfully and not
start the daemon again if it's already running.           
</li>
<li>
<b>9.3.2</b>: /var/run and /var/lock may be mounted as temporary filesystems, and
init scripts must therefore create any necessary subdirectories
dynamically.                                              
</li>
<li>
<b>10.4</b>: /bin/sh scripts may assume that local can take multiple variable
arguments and supports assignment.                        
</li>
<li>
<b>11.6</b>: User mailboxes may be mode 600 and owned by the user rather than
mode 660, owned by user, and group mail.                  

</li>
</ul>
</div>

</div>
