upgrading-checklist.org
*** 3.8.0.0

Released  Jun 2008.

+ *2.4, 3.7*: The base section has been removed.  contrib and non-free have been
  removed from the section list; they are only categories.  The base
  system is now defined by priority.                        
+ *4.9*: If dpkg-source -x doesn't provide the source that will be compiled,
  a debian/rules patch target is recommended and should do whatever
  else is necessary.                                        
+ *4.9.1, 10.1*: Standardized the format of DEB\_BUILD\_OPTIONS.  Specified permitted
  characters for tags, required that tags be whitespace-separated,
  allowed packages to assume non-conflicting tags, and required
  unknown flags be ignored.                                 
+ *4.9.1*: Added parallel=n to the standardized DEB\_BUILD\_OPTIONS tags,
  indicating that a package should be built using up to n parallel
  processes if the package supports it                      
+ *4.13*: Debian packages should not use convenience copies of code from other
  packages unless the included package is explicitly intended to be
  used that way.                                            
+ *4.14*: If dpkg-source -x doesn't produce source ready for editing and
  building with dpkg-buildpackage, packages should include a
  debian/README.source file explaining how to generate the patched
  source, add a new modification, and remove an existing
  modification.  This file may also be used to document packaging a
  new upstream release and any other complexity of the Debian build
  process.                                                  
+ *5.6.3*: The Uploaders field in debian/control may be wrapped.     
+ *5.6.12*: An empty Debian revision is equivalent to a Debian revision of 0 in
  a version number.                                         
+ *5.6.23*: New Homepage field for upstream web sites.                
+ *6.5, 6.6, 7*: The Breaks field declares that this package breaks another and
  prevents installation of the breaking package unless the package
  named in Breaks is deconfigured first.  This field should not be
  used until the dpkg in Debian stable supports it.         
+ *8.1, 8.2*: Clarify which files should go into a shared library package, into a
  separate package, or into the -dev package.  Suggest -tools instead
  of -runtime for runtime support programs, since that naming is more
  common in Debian.                                         
+ *9.5*: Files in /etc/cron.{hourly,daily,weekly,monthly} must be
  configuration files (upgraded from should).  Mention the hourly
  directory.                                                
+ *11.8.6*: Packages providing /etc/X11/Xresources files need not conflict with
  xbase (<< 3.3.2.3a-2), which is long-obsolete.            
+ *12.1*: Manual pages in locale-specific directories should use either the
  legacy encoding for that directory or UTF-8.  Country names should
  not be included in locale-specific manual page directories unless
  indicating a significant difference in the language.  All
  characters in the manual page source should be representable in the
  legacy encoding for a locale even if the man page is encoded in
  UTF-8.                                                    
+ *12.5*: The Apache 2.0 license is now in common-licenses and should be
  referenced rather than quoted in debian/copyright.        
+ *12.5*: Packages in contrib and non-free should state in the copyright file
  that the package is not part of Debian GNU/Linux and briefly
  explain why.                                              
+ *debconf*: Underscore (_) is allowed in debconf template names.      

*** 3.7.3.0 

Released  Dec 2007.

+ *5.6.12*: Package version numbers may contain tildes, which sort before
  anything, even the end of a part.                         
+ *10.4*: Scripts may assume that /bin/sh supports local (at a basic level)
  and that its test builtin (if any) supports -a and -o binary
  logical operators.                                        
+ *8.5*: The substitution variable ${binary:Version} should be used in place
  of ${Source-Version} for dependencies between packages of the same
  library.                                                  
+ *menu policy*: Substantial reorganization and renaming of sections in the Debian
  menu structure.  Packages with menu entries should be reviewed to
  see if the menu section has been renamed or if one of the new
  sections would be more appropriate.                       
+ *5.6.1*: The Source field in a .changes file may contain a version number
  in parentheses.                                           
+ *5.6.17*: The acceptable values for the Urgency field are low, medium, high,
  critical, or emergency.                                   
+ *8.6*: The shlibs file now allows an optional type field, indicating the
  type of package for which the line is valid.  The only currently
  supported type is udeb, used with packages for the Debian
  Installer.                                                
+ *3.9.1*: Packages following the Debian Configuration management
  specification must allow for translation of their messages by using
  a gettext-based system such as po-debconf.                
+ *12.5*: GFDL 1.2, GPL 3, and LGPL 3 are now in common-licenses and should
  be referenced rather than quoted in debian/copyright.

*** 3.7.2.2  

Released  Oct 2006.

+ *6.1*: Maintainer scripts must not be world writeable (up from a
  should to a must)                                         

*** 3.7.2.0   

Released  Apr 2006.

+ *11.5*: Revert the cgi-lib change. 

*** 3.7.1.0    

Released  Apr 2006.

+ *10.2*: It is now possible to create shared libraries without
  relocatable code (using -fPIC) in certain exceptional cases,
  provided some procedures are followed, and for creating static
  libraries with relocatable code (again, using -fPIC).
  Discussion on debian-devel@lists.debian.org, getting a rough
  consensus, and documenting it in README.Debian constitute most
  of the process.                                           
+ *11.8.7*: Packages should install any relevant files into the directories
  /usr/include/X11/and /usr/lib/X11/, but if they do so, they
  must  pre-depend on x11-common (>= 1:7.0.0)              

