upgrading-checklist.html

<div id="outline-container-2.5" class="outline-4">
<h4 id="sec-2.5"><a name="v3.8.0.0" id="v3.8.0.0"></a>3.8.0.0 </h4>
<div class="outline-text-4" id="text-2.5">


<p>
Released  Jun 2008.
</p>
<ul>
<li>
<b>2.4, 3.7</b>: The base section has been removed.  contrib and non-free have been
removed from the section list; they are only categories.  The base
system is now defined by priority.                        
</li>
<li>
<b>4.9</b>: If dpkg-source -x doesn't provide the source that will be compiled,
a debian/rules patch target is recommended and should do whatever
else is necessary.                                        
</li>
<li>
<b>4.9.1, 10.1</b>: Standardized the format of DEB_BUILD_OPTIONS.  Specified permitted
characters for tags, required that tags be whitespace-separated,
allowed packages to assume non-conflicting tags, and required
unknown flags be ignored.                                 
</li>
<li>
<b>4.9.1</b>: Added parallel=n to the standardized DEB_BUILD_OPTIONS tags,
indicating that a package should be built using up to n parallel
processes if the package supports it                      
</li>
<li>
<b>4.13</b>: Debian packages should not use convenience copies of code from other
packages unless the included package is explicitly intended to be
used that way.                                            
</li>
<li>
<b>4.14</b>: If dpkg-source -x doesn't produce source ready for editing and
building with dpkg-buildpackage, packages should include a
debian/README.source file explaining how to generate the patched
source, add a new modification, and remove an existing
modification.  This file may also be used to document packaging a
new upstream release and any other complexity of the Debian build
process.                                                  
</li>
<li>
<b>5.6.3</b>: The Uploaders field in debian/control may be wrapped.     
</li>
<li>
<b>5.6.12</b>: An empty Debian revision is equivalent to a Debian revision of 0 in
a version number.                                         
</li>
<li>
<b>5.6.23</b>: New Homepage field for upstream web sites.                
</li>
<li>
<b>6.5, 6.6, 7</b>: The Breaks field declares that this package breaks another and
prevents installation of the breaking package unless the package
named in Breaks is deconfigured first.  This field should not be
used until the dpkg in Debian stable supports it.         
</li>
<li>
<b>8.1, 8.2</b>: Clarify which files should go into a shared library package, into a
separate package, or into the -dev package.  Suggest -tools instead
of -runtime for runtime support programs, since that naming is more
common in Debian.                                         
</li>
<li>
<b>9.5</b>: Files in /etc/cron.{hourly,daily,weekly,monthly} must be
configuration files (upgraded from should).  Mention the hourly
directory.                                                
</li>
<li>
<b>11.8.6</b>: Packages providing /etc/X11/Xresources files need not conflict with
xbase (&lt;&lt; 3.3.2.3a-2), which is long-obsolete.            
</li>
<li>
<b>12.1</b>: Manual pages in locale-specific directories should use either the
legacy encoding for that directory or UTF-8.  Country names should
not be included in locale-specific manual page directories unless
indicating a significant difference in the language.  All
characters in the manual page source should be representable in the
legacy encoding for a locale even if the man page is encoded in
UTF-8.                                                    
</li>
<li>
<b>12.5</b>: The Apache 2.0 license is now in common-licenses and should be
referenced rather than quoted in debian/copyright.        
</li>
<li>
<b>12.5</b>: Packages in contrib and non-free should state in the copyright file
that the package is not part of Debian GNU/Linux and briefly
explain why.                                              
</li>
<li>
<b>debconf</b>: Underscore (_) is allowed in debconf template names.      

</li>
</ul>
</div>

</div>

<div id="outline-container-2.6" class="outline-4">
<h4 id="sec-2.6"><a name="v3.7.3.0" id="v3.7.3.0"></a>3.7.3.0 </h4>
<div class="outline-text-4" id="text-2.6">


<p>
Released  Dec 2007.
</p>
<ul>
<li>
<b>5.6.12</b>: Package version numbers may contain tildes, which sort before
anything, even the end of a part.                         
</li>
<li>
<b>10.4</b>: Scripts may assume that /bin/sh supports local (at a basic level)
and that its test builtin (if any) supports -a and -o binary
logical operators.                                        
</li>
<li>
<b>8.5</b>: The substitution variable ${binary:Version} should be used in place
of ${Source-Version} for dependencies between packages of the same
library.                                                  
</li>
<li>
<b>menu policy</b>: Substantial reorganization and renaming of sections in the Debian
menu structure.  Packages with menu entries should be reviewed to
see if the menu section has been renamed or if one of the new
sections would be more appropriate.                       
</li>
<li>
<b>5.6.1</b>: The Source field in a .changes file may contain a version number
in parentheses.                                           
</li>
<li>
<b>5.6.17</b>: The acceptable values for the Urgency field are low, medium, high,
critical, or emergency.                                   
</li>
<li>
<b>8.6</b>: The shlibs file now allows an optional type field, indicating the
type of package for which the line is valid.  The only currently
supported type is udeb, used with packages for the Debian
Installer.                                                
</li>
<li>
<b>3.9.1</b>: Packages following the Debian Configuration management
specification must allow for translation of their messages by using
a gettext-based system such as po-debconf.                
</li>
<li>
<b>12.5</b>: GFDL 1.2, GPL 3, and LGPL 3 are now in common-licenses and should
be referenced rather than quoted in debian/copyright.

</li>
</ul>
</div>

</div>

<div id="outline-container-2.7" class="outline-4">
<h4 id="sec-2.7"><a name="v3.7.2.2" id="v3.7.2.2"></a>3.7.2.2 </h4>
<div class="outline-text-4" id="text-2.7">


<p>
Released  Oct 2006.
</p>
<ul>
<li>
<b>6.1</b>: Maintainer scripts must not be world writeable (up from a
should to a must)                                         

</li>
</ul>
</div>

</div>

<div id="outline-container-2.8" class="outline-4">
<h4 id="sec-2.8"><a name="v3.7.2.0" id="v3.7.2.0"></a>3.7.2.0 </h4>
<div class="outline-text-4" id="text-2.8">


<p>
Released  Apr 2006.
</p>
<ul>
<li>
<b>11.5</b>: Revert the cgi-lib change. 

</li>
</ul>
</div>

</div>

<div id="outline-container-2.9" class="outline-4">
<h4 id="sec-2.9"><a name="v3.7.1.0" id="v3.7.1.0"></a>3.7.1.0 </h4>
<div class="outline-text-4" id="text-2.9">


<p>
Released  Apr 2006.
</p>
<ul>
<li>
<b>10.2</b>: It is now possible to create shared libraries without
relocatable code (using -fPIC) in certain exceptional cases,
provided some procedures are followed, and for creating static
libraries with relocatable code (again, using -fPIC).
Discussion on debian-devel@lists.debian.org, getting a rough
consensus, and documenting it in README.Debian constitute most
of the process.                                           
</li>
<li>
<b>11.8.7</b>: Packages should install any relevant files into the directories
<i>usr/include/X11/and /usr/lib/X11</i>, but if they do so, they
must  pre-depend on x11-common (&gt;= 1:7.0.0)              

</li>
</ul>
</div>

</div>
