upgrading-checklist.org
*** 3.7.0.0     

Released  Apr 2006.

+ *11.5*: Packages shipping web server CGI files are expected to install
  them in /usr/lib/cgi-lib/ directories.  This location change
  perhaps should be documented in NEWS                      
+ *11.5*: Web server packages should include a standard scriptAlias of
  cgi-lib to /usr/lib/cgi-lib.                              
+ *9.1.1*: The version of FHS mandated by policy has been upped to
  2.3. There should be no changes required for most packages,
  though new top level directories /media, /srv, etc may be of
  interest.                                                 
+ *5.1, 5.6.3*: All fields, apart from the Uploaders field, in the control file
  are supposed to be a single logical line, which may be spread
  over multiple physical  lines (newline followed by space is
  elided).  However, any parser for the control file must allow
  the Uploaders field to be spread over multiple physical lines
  as well, to prepare for future changes.                 
+ *10.4*: When scripts are installed into a directory in the system
  PATH, the script name should not include an extension that
  denotes the scripting language currently used to implement it.
                                                         
+ *9.3.3.2*: packages that invoke initscripts now must use invoke-rc.d to do
  so since it also pays attention to run levels and other local
  constraints.                                                
+ *11.8.5.2, 11.8.7, etc*: We no longer use /usr/X11R6, since we have
  migrated away to using Xorg paths. This means, for one thing, fonts
  live in /usr/share/fonts/X11/ now, and /usr/X11R6 is gone.
                                                      

*** 3.6.2.0      

Released  2005

+ Recommend. doc-base, and not menu, for registering package documentation.
+ *8.1*: Run time support programs should live in subdirectories of
  /usr/lib/ or /usr/share, and preferably the shared lib is named
  the same as the package name (to avoid name collisions). 
+ *11.5*: It is recommended that HTTP servers provide an alias /images to
  allow packages to share image files with the web server 

*** 3.6.1.0       

Released  Aug 2003.

+ *3.10.1*: Prompting the user should be done using debconf. Non debconf
  user prompts are now deprecated. 

*** 3.6.0        

Released  Jul 2003.

+ Restructuring causing shifts in section numbers and bumping of
  the minor version number:
+ Many packaging manual appendices that were integrated into policy
  sections are now empty, and replaced with links to the Policy.
  In particular, the appendices that included the list of control
  fields were updated (new fields like Closes, Changed-By were added)
  and the list of fields for each of control, .changes and .dsc files
  is now in Policy, and they're marked mandatory, recommended or
  optional based on the current practice and the behavior of the
  deb-building tool-chain.
+ Elimination of needlessly deep section levels, primarily in the
  chapter Debian Archive, from which two new chapters were split out,
  Binary packages and Source packages. What remained was reordered
  properly, that is, some sect1s became sects etc.
+ Several sections that were redundant, crufty or simply not designed
  with any sort of vision, were rearranged according to the formula that
  everything should be either in the same place or properly interlinked.
  Some things remained split up between different chapters when they
  talked about different aspects of files: their content, their syntax,
  and their placement in the file system. In particular, see the new
  sections about changelog files.
+ *menu policy*: Added Games/Simulation and Apps/Education to menu
  sub-policy
+ *C.2.2*: Debian changelogs should be UTF-8 encoded. 
+ *10.2*: shared libraries must be linked against all libraries that they
  use symbols from in the same way that binaries are. 
+ *7.6*: build-depends-indep need not be satisfied during clean
  target. 

*** 3.5.10         

Released  May 2003.

+ *11.8.3*: packages providing the x-terminal-emulator virtual package
  ought to ensure that they interpret the command line exactly
  like xterm does. 
+ *11.8.4*: Window managers compliant with the Window Manager Specification
  Project may add 40 points for ranking in the alternatives 

*** 3.5.9.0          

Released  Mar 2003.

+ *3.4.2*: The section describing the Description: package field once again has
  full details of the long description format. 
+ *4.2*: Clarified that if a package has non-build-essential
  build-dependencies, it should have them listed in the Build-Depends
  and related fields (i.e. it's not merely optional). 
+ *9.3.2*: When asked to restart a service that isn't already running,
  the init script should start the service. 
+ *12.6*: If the purpose of a package is to provide examples, then the
  example files can be installed into =/usr/share/doc/package= (rather
  than =/usr/share/doc/package/examples=).

*** 3.5.8.0           

Released  Nov 2002.

+ *12.7*: It is no longer necessary to keep a log of changes to the upstream
  sources in the copyright file. Instead, all such changes should be
  documented in the changelog file. 
+ *7.6*: =Build-Depends=, =Build-Conflicts=, =Build-Depends-Indep=,
  and =Build-Conflicts-Indep= must also be satisfied when the clean
  target is called.
+ *menu policy*: A new Apps/Science menu section is available 
+ *debconf policy*: debconf specification cleared up, various changes. 
+ *12.1*: It is no longer recommended to create symlinks from nonexistent
  manual pages to undocumented(7). Missing manual pages for programs
  are still a bug. 

*** 3.5.7.0            

Released  Aug 2002.

+ Packages no longer have to ask permission to call MAKEDEV in
  postinst, merely notifying the user ought to be enough. 
+ *2.2.4*: cryptographic software may now be included in the main
  archive. 
+ *3.9*: task packages are no longer permitted; tasks are now created by a
  special Tasks: field in the control file. 
+ *11.8.4*: window managers that support netwm can now add 20 points when
  they add themselves as an alternative for
  /usr/bin/x-window-manager 
+ *10.1*: The default compilation options have now changed, one should
  provide debugging symbols in all cases, and optionally step
  back optimization to -O0, depending on the DEB\_BUILD\_OPTIONS
  environment variable. 
+ *7.6, 4.8*: Added mention of build-arch, build-indep, etc, in describing
  the relationships with `Build-Depends', `Build-Conflicts',
  `Build-Depends-Indep', and `Build-Conflicts-Indep'. May need to
  review the new rules.  
+ *8*: Changed rules on how, and when, to invoke ldconfig in maintainer
  scripts. Long rationale. 

  *Added the last note in 3.5.6 upgrading checklist item regarding build rules, please see below*

