upgrading-checklist.html

<div id="outline-container-2.10" class="outline-4">
<h4 id="sec-2.10"><a name="v3.7.0.0" id="v3.7.0.0"></a>3.7.0.0 </h4>
<div class="outline-text-4" id="text-2.10">


<p>
Released  Apr 2006.
</p>
<ul>
<li>
<b>11.5</b>: Packages shipping web server CGI files are expected to install
them in <i>usr/lib/cgi-lib</i> directories.  This location change
perhaps should be documented in NEWS                      
</li>
<li>
<b>11.5</b>: Web server packages should include a standard scriptAlias of
cgi-lib to /usr/lib/cgi-lib.                              
</li>
<li>
<b>9.1.1</b>: The version of FHS mandated by policy has been upped to
2.3. There should be no changes required for most packages,
though new top level directories /media, /srv, etc may be of
interest.                                                 
</li>
<li>
<b>5.1, 5.6.3</b>: All fields, apart from the Uploaders field, in the control file
are supposed to be a single logical line, which may be spread
over multiple physical  lines (newline followed by space is
elided).  However, any parser for the control file must allow
the Uploaders field to be spread over multiple physical lines
as well, to prepare for future changes.                 
</li>
<li>
<b>10.4</b>: When scripts are installed into a directory in the system
PATH, the script name should not include an extension that
denotes the scripting language currently used to implement it.

</li>
<li>
<b>9.3.3.2</b>: packages that invoke initscripts now must use invoke-rc.d to do
so since it also pays attention to run levels and other local
constraints.                                                
</li>
<li>
<b>11.8.5.2, 11.8.7, etc</b>: We no longer use /usr/X11R6, since we have
migrated away to using Xorg paths. This means, for one thing, fonts
live in <i>usr/share/fonts/X11</i> now, and /usr/X11R6 is gone.


</li>
</ul>
</div>

</div>

<div id="outline-container-2.11" class="outline-4">
<h4 id="sec-2.11"><a name="v3.6.2.0" id="v3.6.2.0"></a>3.6.2.0 </h4>
<div class="outline-text-4" id="text-2.11">


<p>
Released  2005
</p>
<ul>
<li>
Recommend. doc-base, and not menu, for registering package documentation.
</li>
<li>
<b>8.1</b>: Run time support programs should live in subdirectories of
<i>usr/lib</i> or /usr/share, and preferably the shared lib is named
the same as the package name (to avoid name collisions). 
</li>
<li>
<b>11.5</b>: It is recommended that HTTP servers provide an alias /images to
allow packages to share image files with the web server 

</li>
</ul>
</div>

</div>

<div id="outline-container-2.12" class="outline-4">
<h4 id="sec-2.12"><a name="v3.6.1.0" id="v3.6.1.0"></a>3.6.1.0 </h4>
<div class="outline-text-4" id="text-2.12">


<p>
Released  Aug 2003.
</p>
<ul>
<li>
<b>3.10.1</b>: Prompting the user should be done using debconf. Non debconf
user prompts are now deprecated. 

</li>
</ul>
</div>

</div>

<div id="outline-container-2.13" class="outline-4">
<h4 id="sec-2.13"><a name="v3.6.0.0" id="v3.6.0.0"></a>3.6.0 </h4>
<div class="outline-text-4" id="text-2.13">


<p>
Released  Jul 2003.
</p>
<ul>
<li>
Restructuring causing shifts in section numbers and bumping of
the minor version number:
</li>
<li>
Many packaging manual appendices that were integrated into policy
sections are now empty, and replaced with links to the Policy.
In particular, the appendices that included the list of control
fields were updated (new fields like Closes, Changed-By were added)
and the list of fields for each of control, .changes and .dsc files
is now in Policy, and they're marked mandatory, recommended or
optional based on the current practice and the behavior of the
deb-building tool-chain.
</li>
<li>
Elimination of needlessly deep section levels, primarily in the
chapter Debian Archive, from which two new chapters were split out,
Binary packages and Source packages. What remained was reordered
properly, that is, some sect1s became sects etc.
</li>
<li>
Several sections that were redundant, crufty or simply not designed
with any sort of vision, were rearranged according to the formula that
everything should be either in the same place or properly interlinked.
Some things remained split up between different chapters when they
talked about different aspects of files: their content, their syntax,
and their placement in the file system. In particular, see the new
sections about changelog files.
</li>
<li>
<b>menu policy</b>: Added Games/Simulation and Apps/Education to menu
sub-policy
</li>
<li>
<b>C.2.2</b>: Debian changelogs should be UTF-8 encoded. 
</li>
<li>
<b>10.2</b>: shared libraries must be linked against all libraries that they
use symbols from in the same way that binaries are. 
</li>
<li>
<b>7.6</b>: build-depends-indep need not be satisfied during clean
target. 

</li>
</ul>
</div>

</div>

<div id="outline-container-2.14" class="outline-4">
<h4 id="sec-2.14"><a name="v3.5.10.0" id="v3.5.10.0"></a>3.5.10 </h4>
<div class="outline-text-4" id="text-2.14">


<p>
Released  May 2003.
</p>
<ul>
<li>
<b>11.8.3</b>: packages providing the x-terminal-emulator virtual package
ought to ensure that they interpret the command line exactly
like xterm does. 
</li>
<li>
<b>11.8.4</b>: Window managers compliant with the Window Manager Specification
Project may add 40 points for ranking in the alternatives 

</li>
</ul>
</div>

</div>

<div id="outline-container-2.15" class="outline-4">
<h4 id="sec-2.15"><a name="v3.5.9.0" id="v3.5.9.0"></a>3.5.9.0 </h4>
<div class="outline-text-4" id="text-2.15">


<p>
Released  Mar 2003.
</p>
<ul>
<li>
<b>3.4.2</b>: The section describing the Description: package field once again has
full details of the long description format. 
</li>
<li>
<b>4.2</b>: Clarified that if a package has non-build-essential
build-dependencies, it should have them listed in the Build-Depends
and related fields (i.e. it's not merely optional). 
</li>
<li>
<b>9.3.2</b>: When asked to restart a service that isn't already running,
the init script should start the service. 
</li>
<li>
<b>12.6</b>: If the purpose of a package is to provide examples, then the
example files can be installed into <code>/usr/share/doc/package</code> (rather
than <code>/usr/share/doc/package/examples</code>).

</li>
</ul>
</div>

</div>

<div id="outline-container-2.16" class="outline-4">
<h4 id="sec-2.16"><a name="v3.5.8.0" id="v3.5.8.0"></a>3.5.8.0 </h4>
<div class="outline-text-4" id="text-2.16">


<p>
Released  Nov 2002.
</p>
<ul>
<li>
<b>12.7</b>: It is no longer necessary to keep a log of changes to the upstream
sources in the copyright file. Instead, all such changes should be
documented in the changelog file. 
</li>
<li>
<b>7.6</b>: <code>Build-Depends</code>, <code>Build-Conflicts</code>, <code>Build-Depends-Indep</code>,
and <code>Build-Conflicts-Indep</code> must also be satisfied when the clean
target is called.
</li>
<li>
<b>menu policy</b>: A new Apps/Science menu section is available 
</li>
<li>
<b>debconf policy</b>: debconf specification cleared up, various changes. 
</li>
<li>
<b>12.1</b>: It is no longer recommended to create symlinks from nonexistent
manual pages to undocumented(7). Missing manual pages for programs
are still a bug. 

</li>
</ul>
</div>

</div>

<div id="outline-container-2.17" class="outline-4">
<h4 id="sec-2.17"><a name="v3.5.7.0" id="v3.5.7.0"></a>3.5.7.0 </h4>
<div class="outline-text-4" id="text-2.17">


<p>
Released  Aug 2002.
</p>
<ul>
<li>
Packages no longer have to ask permission to call MAKEDEV in
postinst, merely notifying the user ought to be enough. 
</li>
<li>
<b>2.2.4</b>: cryptographic software may now be included in the main
archive. 
</li>
<li>
<b>3.9</b>: task packages are no longer permitted; tasks are now created by a
special Tasks: field in the control file. 
</li>
<li>
<b>11.8.4</b>: window managers that support netwm can now add 20 points when
they add themselves as an alternative for
/usr/bin/x-window-manager 
</li>
<li>
<b>10.1</b>: The default compilation options have now changed, one should
provide debugging symbols in all cases, and optionally step
back optimization to -O0, depending on the DEB_BUILD_OPTIONS
environment variable. 
</li>
<li>
<b>7.6, 4.8</b>: Added mention of build-arch, build-indep, etc, in describing
the relationships with `Build-Depends', `Build-Conflicts',
`Build-Depends-Indep', and `Build-Conflicts-Indep'. May need to
review the new rules.  
</li>
<li>
<b>8</b>: Changed rules on how, and when, to invoke ldconfig in maintainer
scripts. Long rationale. 

<p>
<b>Added the last note in 3.5.6 upgrading checklist item regarding build rules, please see below</b>
</p>
</li>
</ul>
</div>

</div>
