upgrading-checklist.org
*** 3.5.6.0             

Released  Jul 2001.

+ *2.5*: Emacs and TeX are no longer mandated by policy to be priority
  standard packages 
+ *11.5*: Programs that access docs need to do so via /usr/share/doc, and
  not via /usr/doc/ as was the policy previously 
+ *12.3*: Putting documentation in /usr/doc versus /usr/share/doc is now
  a ``serious'' policy violation. 
+ *11.5*: For web servers, one should not provide non-local access to the
  /usr/share/doc hierarchy. If one can't provide access controls for
  the http://localhost/doc/ directory, then it is preferred that one
  ask permission to expose that information during the install. 
+ *7*: There are new rules for build-indep/build-arch targets and
  there is a new Build-Depend-Indep semantic. 

*** 3.5.5.0              

Released  May 2001.

+ *12.1*: Manpages should not rely on header information to have
  alternative manpage names available; it should only use
  symlinks or .so pages to do this 
+ *Clarified note in 3.5.3.0 upgrading checklist regarding
   examples and templates: this refers only to those examples used
   by scripts; see section 10.7.3 for the whole story*
+ Included a new section 10.9.1 describing the use of
  dpkg-statoverride; this does not have the weight of policy
+ Clarify Standards-Version: you don't need to rebuild your
  packages just to change the Standards-Version!
+ *10.2*: Plugins are no longer bound by all the rules of shared
  libraries 
+ X Windows related things:
  * *11.8.1*: Clarification of priority levels of X Window System related
    packages 
  * *11.8.3*: Rules for defining x-terminal-emulator improved
  * *11.8.5*: X Font policy rewritten: you must read this if you provide
    fonts for the X Window System 
  * *11.8.6*: Packages must not ship /usr/X11R6/lib/X11/app-defaults/
  * *11.8.7*: X-related packages should usually use the regular FHS
    locations; imake-using packages are exempted from this 
  * *11.8.8*: OpenMotif linked binaries have the same rules as
    OSF/Motif-linked ones 

*** 3.5.4.0

Released  Apr 2001.

+ *11.6*: The system-wide mail directory is now /var/mail, no longer
  /var/spool/mail.  Any packages accessing the mail spool should
  access it via /var/mail and include a suitable Depends field;
  details in 
+ *11.9; perl-policy*: The perl policy is now part of Debian policy
  proper. Perl programs and modules should follow the current Perl
  policy
  

*** 3.5.3.0                
    Apr 2001

+ *7.1*: Build-Depends arch syntax has been changed to be less
  ambiguous. This should not affect any current packages 
+ *10.7.3*: Examples and templates files for use by scripts should now live
  in /usr/share/&lt;package&gt; or /usr/lib/&lt;package&gt;, with
  symbolic links from /usr/share/doc/&lt;package&gt;/examples as
  needed

*** 3.5.2.0

Released Feb 2001.

+ *11.8.6*: X app-defaults directory has moved from
  /usr/X11R6/lib/X11/app-defaults to /etc/X11/app-defaults 

*** 3.5.1.0

Released Feb 2001.

+ *8.1*: dpkg-shlibdeps now uses objdump, so shared libraries have to be
  run through dpkg-shlibdeps as well as executables 

*** 3.5.0.0

Released Jan 2001.

+ *11.8.5*: Font packages for the X Window System must now declare a
  dependency on xutils (>= 4.0.2) 

*** 3.2.1.1

Released Jan 2001.

+ Daemon startup scripts in /etc/init.d/ should not contain
  modifiable parameters; these should be moved to a file in
  /etc/default/; see *9.3.2] for details
+ *12.3*: Files in /usr/share/doc must not be referenced by any
  program.  If such files are needed, they must be placed in
  /usr/share/&lt;package&gt;/, and symbolic links created as required
  in /usr/share/doc/&lt;package&gt;/ 
+ Much of the packaging manual has now been imported into the
  policy document

*** 3.2.1.0

Released Aug 00.

+ *11.8.1*: A package of priority standard or higher may provide two
  binaries, one compiled with support for the X Window System,
  and the other without 

*** 3.2.0.0

Released Aug 00.

+ *10.1*: By default executables should not be built with the debugging
  option -g. Instead, it is recommended to support building the
  package with debugging information optionally.  Details in 
+ *12.8*: Policy for packages where the upstream uses HTML changelog
  files has been expanded.  In short, a plain text changelog file
  should always be generated for the upstream changes 
+ Please note that the new release of the X window system (3.2)
  shall probably need sweeping changes in policy
+ Policy for packages providing the following X-based features
  has been codified:
  - *11.8.2*: X server (virtual package xserver) 
  - *11.8.3*: X terminal emulator (virtual package x-terminal-emulator) 
  - *11.8.4*: X window manager (virtual package x-window-manager, and
    /usr/bin/x-window-manager alternative, with priority
    calculation guidelines) 
  - *12.8.5*: X fonts (this section has been written from scratch) 
  - *11.8.6*: X application defaults 
+ *11.8.7*: Policy for packages using the X Window System and FHS issues
  has been clarified; see 
+ *11.7.3*: No package may contain or make hard links to conffiles 
+ *8*: Noted that newer dpkg versions do not require extreme care in
  always creating the shared lib before the symlink, so the unpack
  order be correct 

*** 3.1.1.0

Released Nov 1999.

+ *7.1*: Correction to semantics of architecture lists in Build-Depends
  etc.  Should not affect many packages 

