upgrading-checklist.html

<div id="outline-container-2.18" class="outline-4">
<h4 id="sec-2.18"><a name="v3.5.6.0" id="v3.5.6.0"></a>3.5.6.0 </h4>
<div class="outline-text-4" id="text-2.18">


<p>
Released  Jul 2001.
</p>
<ul>
<li>
<b>2.5</b>: Emacs and TeX are no longer mandated by policy to be priority
standard packages 
</li>
<li>
<b>11.5</b>: Programs that access docs need to do so via <i>usr/share/doc, and   not via /usr/doc</i> as was the policy previously 
</li>
<li>
<b>12.3</b>: Putting documentation in /usr/doc versus /usr/share/doc is now
a ``serious'' policy violation. 
</li>
<li>
<b>11.5</b>: For web servers, one should not provide non-local access to the
/usr/share/doc hierarchy. If one can't provide access controls for
the <a href="http://localhost/doc/">http://localhost/doc/</a> directory, then it is preferred that one
ask permission to expose that information during the install. 
</li>
<li>
<b>7</b>: There are new rules for build-indep/build-arch targets and
there is a new Build-Depend-Indep semantic. 

</li>
</ul>
</div>

</div>

<div id="outline-container-2.19" class="outline-4">
<h4 id="sec-2.19"><a name="v3.5.5.0" id="v3.5.5.0"></a>3.5.5.0 </h4>
<div class="outline-text-4" id="text-2.19">


<p>
Released  May 2001.
</p>
<ul>
<li>
<b>12.1</b>: Manpages should not rely on header information to have
alternative manpage names available; it should only use
symlinks or .so pages to do this 
</li>
<li>
*Clarified note in 3.5.3.0 upgrading checklist regarding
examples and templates: this refers only to those examples used
by scripts; see section 10.7.3 for the whole story*
</li>
<li>
Included a new section 10.9.1 describing the use of
dpkg-statoverride; this does not have the weight of policy
</li>
<li>
Clarify Standards-Version: you don't need to rebuild your
packages just to change the Standards-Version!
</li>
<li>
<b>10.2</b>: Plugins are no longer bound by all the rules of shared
libraries 
</li>
<li>
X Windows related things:
<ul>
<li>
<b>11.8.1</b>: Clarification of priority levels of X Window System related
packages 
</li>
<li>
<b>11.8.3</b>: Rules for defining x-terminal-emulator improved
</li>
<li>
<b>11.8.5</b>: X Font policy rewritten: you must read this if you provide
fonts for the X Window System 
</li>
<li>
<b>11.8.6</b>: Packages must not ship <i>usr/X11R6/lib/X11/app-defaults</i>
</li>
<li>
<b>11.8.7</b>: X-related packages should usually use the regular FHS
locations; imake-using packages are exempted from this 
</li>
<li>
<b>11.8.8</b>: OpenMotif linked binaries have the same rules as
OSF/Motif-linked ones 

</li>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-2.20" class="outline-4">
<h4 id="sec-2.20"><a name="v3.5.4.0" id="v3.5.4.0"></a>3.5.4.0 </h4>
<div class="outline-text-4" id="text-2.20">


<p>
Released  Apr 2001.
</p>
<ul>
<li>
<b>11.6</b>: The system-wide mail directory is now /var/mail, no longer
/var/spool/mail.  Any packages accessing the mail spool should
access it via /var/mail and include a suitable Depends field;
details in 
</li>
<li>
<b>11.9; perl-policy</b>: The perl policy is now part of Debian policy
proper. Perl programs and modules should follow the current Perl
policy


</li>
</ul>
</div>

</div>

<div id="outline-container-2.21" class="outline-4">
<h4 id="sec-2.21"><a name="v3.5.3.0" id="v3.5.3.0"></a>3.5.3.0 </h4>
<div class="outline-text-4" id="text-2.21">


<p>
Apr 2001
</p>
<ul>
<li>
<b>7.1</b>: Build-Depends arch syntax has been changed to be less
ambiguous. This should not affect any current packages 
</li>
<li>
<b>10.7.3</b>: Examples and templates files for use by scripts should now live
in /usr/share/&amp;lt;package&amp;gt; or /usr/lib/&amp;lt;package&amp;gt;, with
symbolic links from /usr/share/doc/&amp;lt;package&amp;gt;/examples as
needed

</li>
</ul>
</div>

</div>

<div id="outline-container-2.22" class="outline-4">
<h4 id="sec-2.22"><a name="v3.5.2.0" id="v3.5.2.0"></a>3.5.2.0 </h4>
<div class="outline-text-4" id="text-2.22">


<p>
Released Feb 2001.
</p>
<ul>
<li>
<b>11.8.6</b>: X app-defaults directory has moved from
/usr/X11R6/lib/X11/app-defaults to /etc/X11/app-defaults 

</li>
</ul>
</div>

</div>

<div id="outline-container-2.23" class="outline-4">
<h4 id="sec-2.23"><a name="v3.5.1.0" id="v3.5.1.0"></a>3.5.1.0 </h4>
<div class="outline-text-4" id="text-2.23">


<p>
Released Feb 2001.
</p>
<ul>
<li>
<b>8.1</b>: dpkg-shlibdeps now uses objdump, so shared libraries have to be
run through dpkg-shlibdeps as well as executables 

</li>
</ul>
</div>

</div>

<div id="outline-container-2.24" class="outline-4">
<h4 id="sec-2.24"><a name="v3.5.0.0" id="v3.5.0.0"></a>3.5.0.0 </h4>
<div class="outline-text-4" id="text-2.24">


<p>
Released Jan 2001.
</p>
<ul>
<li>
<b>11.8.5</b>: Font packages for the X Window System must now declare a
dependency on xutils (&gt;= 4.0.2) 

</li>
</ul>
</div>

</div>

<div id="outline-container-2.25" class="outline-4">
<h4 id="sec-2.25"><a name="v3.2.1.1" id="v3.2.1.1"></a>3.2.1.1 </h4>
<div class="outline-text-4" id="text-2.25">


<p>
Released Jan 2001.
</p>
<ul>
<li>
Daemon startup scripts in <i>etc/init.d</i> should not contain
modifiable parameters; these should be moved to a file in
<i>etc/default</i>; see <b>9.3.2] for details + *12.3</b>: Files in /usr/share/doc must not be referenced by any
program.  If such files are needed, they must be placed in
<i>usr/share/&amp;lt;package&amp;gt;</i>, and symbolic links created as required
in <i>usr/share/doc/&amp;lt;package&amp;gt;</i> 
</li>
<li>
Much of the packaging manual has now been imported into the
policy document

</li>
</ul>
</div>

</div>

<div id="outline-container-2.26" class="outline-4">
<h4 id="sec-2.26"><a name="v3.2.1.0" id="v3.2.1.0"></a>3.2.1.0 </h4>
<div class="outline-text-4" id="text-2.26">


<p>
Released Aug 00.
</p>
<ul>
<li>
<b>11.8.1</b>: A package of priority standard or higher may provide two
binaries, one compiled with support for the X Window System,
and the other without 

</li>
</ul>
</div>

</div>

<div id="outline-container-2.27" class="outline-4">
<h4 id="sec-2.27"><a name="v3.2.0.0" id="v3.2.0.0"></a>3.2.0.0 </h4>
<div class="outline-text-4" id="text-2.27">


<p>
Released Aug 00.
</p>
<ul>
<li>
<b>10.1</b>: By default executables should not be built with the debugging
option -g. Instead, it is recommended to support building the
package with debugging information optionally.  Details in 
</li>
<li>
<b>12.8</b>: Policy for packages where the upstream uses HTML changelog
files has been expanded.  In short, a plain text changelog file
should always be generated for the upstream changes 
</li>
<li>
Please note that the new release of the X window system (3.2)
shall probably need sweeping changes in policy
</li>
<li>
Policy for packages providing the following X-based features
has been codified:
<ul>
<li>
<b>11.8.2</b>: X server (virtual package xserver) 
</li>
<li>
<b>11.8.3</b>: X terminal emulator (virtual package x-terminal-emulator) 
</li>
<li>
<b>11.8.4</b>: X window manager (virtual package x-window-manager, and
/usr/bin/x-window-manager alternative, with priority
calculation guidelines) 
</li>
<li>
<b>12.8.5</b>: X fonts (this section has been written from scratch) 
</li>
<li>
<b>11.8.6</b>: X application defaults 
</li>
</ul>
</li>
<li>
<b>11.8.7</b>: Policy for packages using the X Window System and FHS issues
has been clarified; see 
</li>
<li>
<b>11.7.3</b>: No package may contain or make hard links to conffiles 
</li>
<li>
<b>8</b>: Noted that newer dpkg versions do not require extreme care in
always creating the shared lib before the symlink, so the unpack
order be correct 

</li>
</ul>
</div>

</div>

<div id="outline-container-2.28" class="outline-4">
<h4 id="sec-2.28"><a name="v3.1.1.0" id="v3.1.1.0"></a>3.1.1.0 </h4>
<div class="outline-text-4" id="text-2.28">


<p>
Released Nov 1999.
</p>
<ul>
<li>
<b>7.1</b>: Correction to semantics of architecture lists in Build-Depends
etc.  Should not affect many packages 

</li>
</ul>
</div>

</div>
