upgrading-checklist.org
*** 3.1.0.0

Released Oct 1999.

+ /usr/doc/&lt;package&gt; has to be a symlink pointing to
  /usr/share/doc/&lt;package&gt;, to be maintained by postinst
  and prerm scripts.  Details are in *defunct*
+ *7.1, 7.6*: Introduced source dependencies (Build-Depends, etc.) 
+ *9.3.4*: /etc/rc.boot has been deprecated in favour of /etc/rcS.d.
  (Packages should not be touching this directory, but should use
  update-rc.d instead) 
+ *9.3.3*: update-rc.d is now the *only* allowable way of accessing the
  /etc/rc?.d/*SK]??* links.  Any scripts which manipulate them
  directly must be changed to use update-rc.d instead.  (This is
  because the file-rc package handles this information in an
  incompatible way.) 
+ *12.7*: Architecture-specific examples go in /usr/lib/&lt;package&gt;/examples
  with symlinks from /usr/share/doc/&lt;package&gt;/examples/* or from
  /usr/share/doc/&lt;package&gt;/examples itself 
+ *9.1.1*: Updated FHS to a 2.1 draft; this reverts /var/state to
  /var/lib 
+ *9.7; mime-policy*: Added MIME sub-policy document 
+ *12.4*: VISUAL is allowed as a (higher priority) alternative to EDITOR 
+ *11.6*: Modified liblockfile description, which affects
  mailbox-accessing programs.  Please see the policy document for
  details 
+ *12.7*: If a package provides a changelog in HTML format, a text-only
  version should also be included.  (Such a version may be prepared
  using lynx -dump -nolist.) 
+ *3.2.1*: Description of how to handle version numbers based on dates
  added 

*** 3.0.1.0

Released Jul 1999.

+ *10.2*: Added the clarification that the .la files are essential for
  the packages using libtool's libltdl library, in which case the .la
  files must go in the run-time library package

*** 3.0.0.0

Released Jun 1999.

+ *9.1*: Debian formally moves from the FSSTND to the FHS. This is a
  major change, and the implications of this move are probably
  not all known. 
+ *4.1*: Only 3 digits of the Standards version need be included in
  control files, though all four digits are still permitted. 
+ *12.6*: The location of the GPL has changed to
  /usr/share/common-licenses. This may require changing the
  copyright files to point to the correct location of the GPL and
  other major licenses 
+ *10.2*: Packages that use libtool to create shared libraries must
  include the .la files in the -dev packages 
+ *10.8*: Use logrotate to rotate log files 
+ *now 11.8*: section 5.8 has been rewritten (Programs for the X Window
  System) 
+ *9.6; menu-policy*: There is now an associated menu policy, in a separate document,
  that carries the full weight of Debian policy 
+ *11.3*: Programs which need to modify the files /var/run/utmp,
  /var/log/wtmp and /var/log/lastlog must be installed setgid utmp 


   *Please note that section numbers below this point may not be up to date*


*** 2.5.0.0

Released Oct 1998.

Policy Manual:
+ Rearranged the manual to create a new Section 4, Files
  + Section 3.3 ("Files") was moved to Section 4. The Sections
    that  were Section 4 and Section 5 were  moved down to become
    Section 5 and Section 6.
  + What was Section 5.5 ("Log files") is now a subsection of the
    new Section 4 ("Files"), becoming section 4.8, placed after
    "Configuration files", moving the Section 4.8 ("Permissions
    and owners") to Section 4.9.  All subsections of the old
    Section 5 after 5.5  were moved down to fill in the number
    gap.
+ Modified the section about changelog files to accommodate
  upstream changelogs which were formatted as HTML/ These
  upstream changelog files should now be accessible as
  /usr/doc/package/changelog.html.gz
  + Symlinks are permissible to link the real, or upstream,
    changelog name to the Debian mandated name.
+ Clarified that HTML documentation should be present in some
  package, though not necessarily the main binary package.
+ Corrected all references to the location of the copyright
  files. The correct location is /usr/doc/package/copyright
+ Ratified the architecture specification strings to cater to the
  HURD.

*** 2.4.1.0

Released Apr 1998.

**** Policy Manual:
+ Updated section 3.3.5 Symbolic links:
  + symbolic links within a toplevel directory should be relative,
    symbolic links between toplevel directories should be absolute
    (cf., Policy Weekly Issue#6, topic 2)

+ Updated section 4.9 Games:
  + manpages for games should be installed in /usr/man/man6
    (cf., Policy Weekly Issue#6, topic 3)

**** Packaging Manual:
+ Updated prefix of chapter 12, Shared Libraries:
  ldconfig must be called in the postinst script if the package
  installs shared libraries
  (cf., Policy Weekly Issue #6, fixes:bug#20515)

*** 2.4.0.0

Released Jan 1998

+ Updated section 3.3.4 Scripts:
  + /bin/sh may be any POSIX compatible shell
  + scripts including bashisms have to specify /bin/bash as
    interpreter
  + scripts which create files in world-writable directories
    (e.g., in /tmp) should use tempfile or mktemp for creating
    the directory

+ Updated section 3.3.5 Symbolic Links:
  + symbolic links referencing compressed files must have the same
    file extension as the referenced file

+ Updated section 3.3.6 Device files:
  + /dev/tty* serial devices should be used instead of /dev/cu*

+ Updated section 3.4.2 Writing the scripts in /etc/init.d:
  + all /etc/init.d scripts have to provide the following options:
    start, stop, restart, force-reload
  + the reload option is optional and must never stop and restart
    the service

+ Updated section 3.5 Cron jobs:
  + cron jobs that need to be executed more often than daily should
    be installed into /etc/cron.d

+ Updated section 3.7 Menus:
  + removed section about how to register HTML docs to `menu'
    (the corresponding section in 4.4, Web servers and applications,
    has been removed in policy 2.2.0.0 already, so this one was
    obsolete)

+ New section 3.8 Keyboard configuration:
  + details about how the backspace and delete keys should be
    handled

+ New section 3.9 Environment variables:
  + no program must depend on environment variables to get a
    reasonable default configuration

+ New section 4.6 News system configuration:
  + /etc/news/organization and /etc/news/server should be supported
    by all news servers and clients

+ Updated section 4.7 Programs for the X Window System:
  + programs requiring a non-free Motif library should be provided
    as foo-smotif and foo-dmotif package
  + if lesstif works reliably for such program, it should be linked
    against lesstif and not against a non-free Motif library

+ Updated section 4.9 Games:
  + games for X Windows have to be installed in /usr/games, just as
    non-X games

