upgrading-checklist.html

<div id="outline-container-2.29" class="outline-4">
<h4 id="sec-2.29"><a name="v3.1.0.0" id="v3.1.0.0"></a>3.1.0.0 </h4>
<div class="outline-text-4" id="text-2.29">


<p>
Released Oct 1999.
</p>
<ul>
<li>
/usr/doc/&amp;lt;package&amp;gt; has to be a symlink pointing to
/usr/share/doc/&amp;lt;package&amp;gt;, to be maintained by postinst
and prerm scripts.  Details are in <b>defunct</b>
</li>
<li>
<b>7.1, 7.6</b>: Introduced source dependencies (Build-Depends, etc.) 
</li>
<li>
<b>9.3.4</b>: /etc/rc.boot has been deprecated in favour of /etc/rcS.d.
(Packages should not be touching this directory, but should use
update-rc.d instead) 
</li>
<li>
<b>9.3.3</b>: update-rc.d is now the <b>only</b> allowable way of accessing the
/etc/rc?.d/*SK]??* links.  Any scripts which manipulate them
directly must be changed to use update-rc.d instead.  (This is
because the file-rc package handles this information in an
incompatible way.) 
</li>
<li>
<b>12.7</b>: Architecture-specific examples go in /usr/lib/&amp;lt;package&amp;gt;/examples
with symlinks from /usr/share/doc/&amp;lt;package&amp;gt;/examples/* or from
/usr/share/doc/&amp;lt;package&amp;gt;/examples itself 
</li>
<li>
<b>9.1.1</b>: Updated FHS to a 2.1 draft; this reverts /var/state to
/var/lib 
</li>
<li>
<b>9.7; mime-policy</b>: Added MIME sub-policy document 
</li>
<li>
<b>12.4</b>: VISUAL is allowed as a (higher priority) alternative to EDITOR 
</li>
<li>
<b>11.6</b>: Modified liblockfile description, which affects
mailbox-accessing programs.  Please see the policy document for
details 
</li>
<li>
<b>12.7</b>: If a package provides a changelog in HTML format, a text-only
version should also be included.  (Such a version may be prepared
using lynx -dump -nolist.) 
</li>
<li>
<b>3.2.1</b>: Description of how to handle version numbers based on dates
added 

</li>
</ul>
</div>

</div>

<div id="outline-container-2.30" class="outline-4">
<h4 id="sec-2.30"><a name="v3.0.1.0" id="v3.0.1.0"></a>3.0.1.0 </h4>
<div class="outline-text-4" id="text-2.30">


<p>
Released Jul 1999.
</p>
<ul>
<li>
<b>10.2</b>: Added the clarification that the .la files are essential for
the packages using libtool's libltdl library, in which case the .la
files must go in the run-time library package

</li>
</ul>
</div>

</div>

<div id="outline-container-2.31" class="outline-4">
<h4 id="sec-2.31"><a name="v3.0.0.0" id="v3.0.0.0"></a>3.0.0.0 </h4>
<div class="outline-text-4" id="text-2.31">


<p>
Released Jun 1999.
</p>
<ul>
<li>
<b>9.1</b>: Debian formally moves from the FSSTND to the FHS. This is a
major change, and the implications of this move are probably
not all known. 
</li>
<li>
<b>4.1</b>: Only 3 digits of the Standards version need be included in
control files, though all four digits are still permitted. 
</li>
<li>
<b>12.6</b>: The location of the GPL has changed to
/usr/share/common-licenses. This may require changing the
copyright files to point to the correct location of the GPL and
other major licenses 
</li>
<li>
<b>10.2</b>: Packages that use libtool to create shared libraries must
include the .la files in the -dev packages 
</li>
<li>
<b>10.8</b>: Use logrotate to rotate log files 
</li>
<li>
<b>now 11.8</b>: section 5.8 has been rewritten (Programs for the X Window
System) 
</li>
<li>
<b>9.6; menu-policy</b>: There is now an associated menu policy, in a separate document,
that carries the full weight of Debian policy 
</li>
<li>
<b>11.3</b>: Programs which need to modify the files /var/run/utmp,
/var/log/wtmp and /var/log/lastlog must be installed setgid utmp 


<p>
<b>Please note that section numbers below this point may not be up to date</b>
</p>

</li>
</ul>
</div>

</div>

<div id="outline-container-2.32" class="outline-4">
<h4 id="sec-2.32"><a name="v2.5.0.0" id="v2.5.0.0"></a>2.5.0.0 </h4>
<div class="outline-text-4" id="text-2.32">


<p>
Released Oct 1998.
</p>
<p>
Policy Manual:
</p><ul>
<li>
Rearranged the manual to create a new Section 4, Files
<ul>
<li>
Section 3.3 ("Files") was moved to Section 4. The Sections
that  were Section 4 and Section 5 were  moved down to become
Section 5 and Section 6.
</li>
<li>
What was Section 5.5 ("Log files") is now a subsection of the
new Section 4 ("Files"), becoming section 4.8, placed after
"Configuration files", moving the Section 4.8 ("Permissions
and owners") to Section 4.9.  All subsections of the old
Section 5 after 5.5  were moved down to fill in the number
gap.
</li>
</ul>
</li>
<li>
Modified the section about changelog files to accommodate
upstream changelogs which were formatted as HTML/ These
upstream changelog files should now be accessible as
/usr/doc/package/changelog.html.gz
<ul>
<li>
Symlinks are permissible to link the real, or upstream,
changelog name to the Debian mandated name.
</li>
</ul>
</li>
<li>
Clarified that HTML documentation should be present in some
package, though not necessarily the main binary package.
</li>
<li>
Corrected all references to the location of the copyright
files. The correct location is /usr/doc/package/copyright
</li>
<li>
Ratified the architecture specification strings to cater to the
HURD.

</li>
</ul>
</div>

</div>

<div id="outline-container-2.33" class="outline-4">
<h4 id="sec-2.33"><a name="v2.4.1.0" id="v2.4.1.0"></a>2.4.1.0 </h4>
<div class="outline-text-4" id="text-2.33">


<p>
Released Apr 1998.
</p>
<ul>
<li id="sec-2.33.1">Policy Manual: <br/>
<ul>
<li>
Updated section 3.3.5 Symbolic links:
<ul>
<li>
symbolic links within a toplevel directory should be relative,
symbolic links between toplevel directories should be absolute
(cf., Policy Weekly Issue#6, topic 2)

</li>
</ul>
</li>
<li>
Updated section 4.9 Games:
<ul>
<li>
manpages for games should be installed in /usr/man/man6
(cf., Policy Weekly Issue#6, topic 3)

</li>
</ul>
</li>
</ul>
</li>
<li id="sec-2.33.2">Packaging Manual: <br/>
<ul>
<li>
Updated prefix of chapter 12, Shared Libraries:
ldconfig must be called in the postinst script if the package
installs shared libraries
(cf., Policy Weekly Issue #6, fixes:bug#20515)

</li>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-2.34" class="outline-4">
<h4 id="sec-2.34"><a name="v2.4.0.0" id="v2.4.0.0"></a>2.4.0.0 </h4>
<div class="outline-text-4" id="text-2.34">


<p>
Released Jan 1998
</p>
<ul>
<li>
Updated section 3.3.4 Scripts:
<ul>
<li>
/bin/sh may be any POSIX compatible shell
</li>
<li>
scripts including bashisms have to specify /bin/bash as
interpreter
</li>
<li>
scripts which create files in world-writable directories
(e.g., in /tmp) should use tempfile or mktemp for creating
the directory

</li>
</ul>
</li>
<li>
Updated section 3.3.5 Symbolic Links:
<ul>
<li>
symbolic links referencing compressed files must have the same
file extension as the referenced file

</li>
</ul>
</li>
<li>
Updated section 3.3.6 Device files:
<ul>
<li>
/dev/tty* serial devices should be used instead of /dev/cu*

</li>
</ul>
</li>
<li>
Updated section 3.4.2 Writing the scripts in /etc/init.d:
<ul>
<li>
all /etc/init.d scripts have to provide the following options:
start, stop, restart, force-reload
</li>
<li>
the reload option is optional and must never stop and restart
the service

</li>
</ul>
</li>
<li>
Updated section 3.5 Cron jobs:
<ul>
<li>
cron jobs that need to be executed more often than daily should
be installed into /etc/cron.d

</li>
</ul>
</li>
<li>
Updated section 3.7 Menus:
<ul>
<li>
removed section about how to register HTML docs to `menu'
(the corresponding section in 4.4, Web servers and applications,
has been removed in policy 2.2.0.0 already, so this one was
obsolete)

</li>
</ul>
</li>
<li>
New section 3.8 Keyboard configuration:
<ul>
<li>
details about how the backspace and delete keys should be
handled

</li>
</ul>
</li>
<li>
New section 3.9 Environment variables:
<ul>
<li>
no program must depend on environment variables to get a
reasonable default configuration

</li>
</ul>
</li>
<li>
New section 4.6 News system configuration:
<ul>
<li>
/etc/news/organization and /etc/news/server should be supported
by all news servers and clients

</li>
</ul>
</li>
<li>
Updated section 4.7 Programs for the X Window System:
<ul>
<li>
programs requiring a non-free Motif library should be provided
as foo-smotif and foo-dmotif package
</li>
<li>
if lesstif works reliably for such program, it should be linked
against lesstif and not against a non-free Motif library

</li>
</ul>
</li>
<li>
Updated section 4.9 Games:
<ul>
<li>
games for X Windows have to be installed in /usr/games, just as
non-X games

</li>
</ul>
</li>
</ul>
</div>

</div>
