upgrading-checklist.org
*** 2.3.0.1, 2.3.0.0

Released Sep 1997.

+ new section `4.2 Daemons' including rules for
  /etc/services, /etc/protocols, /etc/rpc, and /etc/inetd.conf

+ updated section about `Configuration files':
  packages may not touch other packages' configuration files

+ MUAs and MTAs have to use liblockfile

*** 2.2.0.0				Jul

Released 1997.

+ added section 4.1 `Architecture specification strings':
  use
       <arch>-linux
  where <arch> is one of the following:
       i386, alpha, arm, m68k, powerpc, sparc.

+ detailed rules for /usr/local

+ user ID's

+ editor/pager policy

+ cron jobs

+ device files

+ don't install shared libraries as executable

+ app-defaults files may not be conffiles

*** 2.1.3.2, 2.1.3.1, 2.1.3.0

Released Mar 1997.

+ two programs with different functionality must not have the
  same name

+ "Webstandard 3.0"

+ "Standard for Console Messages"

+ Libraries should be compiled with `-D\_REENTRANT'

+ Libraries should be stripped with "strip --strip-unneeded"

*** 2.1.2.2, 2.1.2.1, 2.1.2.0

Released Nov 1996.

+ Some changes WRT shared libraries

*** 2.1.1.0

Released Sep 1996.

+ No hard links in source packages

+ Do not use dpkg-divert or update-alternatives without consultation

+ Shared libraries must be installed stripped

*** 2.1.0.0

Released Aug 1996.

+ Upstream changelog must be installed too
