upgrading-checklist.html

<div id="outline-container-2.35" class="outline-4">
<h4 id="sec-2.35"><a name="v2.3.0" id="v2.3.0"></a>2.3.0.1, 2.3.0.0 </h4>
<div class="outline-text-4" id="text-2.35">


<p>
Released Sep 1997.
</p>
<ul>
<li>
new section `4.2 Daemons' including rules for
/etc/services, /etc/protocols, /etc/rpc, and /etc/inetd.conf

</li>
<li>
updated section about `Configuration files':
packages may not touch other packages' configuration files

</li>
<li>
MUAs and MTAs have to use liblockfile

</li>
</ul>
</div>

</div>

<div id="outline-container-2.36" class="outline-4">
<h4 id="sec-2.36"><a name="v2.2.0.0" id="v2.2.0.0"></a>2.2.0.0 </h4>
<div class="outline-text-4" id="text-2.36">


<p>
Released July 1997.
</p>
<ul>
<li>
added section 4.1 `Architecture specification strings':
use
&lt;arch&gt;-linux
where &lt;arch&gt; is one of the following:
i386, alpha, arm, m68k, powerpc, sparc.

</li>
<li>
detailed rules for /usr/local

</li>
<li>
user ID's

</li>
<li>
editor/pager policy

</li>
<li>
cron jobs

</li>
<li>
device files

</li>
<li>
don't install shared libraries as executable

</li>
<li>
app-defaults files may not be conffiles

</li>
</ul>
</div>

</div>

<div id="outline-container-2.37" class="outline-4">
<h4 id="sec-2.37"><a name="v2.1.3" id="v2.1.3"></a>2.1.3.2, 2.1.3.1, 2.1.3.0 </h4>
<div class="outline-text-4" id="text-2.37">


<p>
Released Mar 1997.
</p>
<ul>
<li>
two programs with different functionality must not have the
same name

</li>
<li>
"Webstandard 3.0"

</li>
<li>
"Standard for Console Messages"

</li>
<li>
Libraries should be compiled with `-D_REENTRANT'

</li>
<li>
Libraries should be stripped with "strip &ndash;strip-unneeded"

</li>
</ul>
</div>

</div>

<div id="outline-container-2.38" class="outline-4">
<h4 id="sec-2.38"><a name="v2.1.2" id="v2.1.2"></a>2.1.2.2, 2.1.2.1, 2.1.2.0 </h4>
<div class="outline-text-4" id="text-2.38">


<p>
Released Nov 1996.
</p>
<ul>
<li>
Some changes WRT shared libraries

</li>
</ul>
</div>

</div>

<div id="outline-container-2.39" class="outline-4">
<h4 id="sec-2.39"><a name="v2.1.1" id="v2.1.1"></a>2.1.1.0 </h4>
<div class="outline-text-4" id="text-2.39">


<p>
Released Sep 1996.
</p>
<ul>
<li>
No hard links in source packages

</li>
<li>
Do not use dpkg-divert or update-alternatives without consultation

</li>
<li>
Shared libraries must be installed stripped

</li>
</ul>
</div>

</div>

<div id="outline-container-2.40" class="outline-4">
<h4 id="sec-2.40"><a name="v2.1.0.0" id="v2.1.0.0"></a>2.1.0.0 </h4>
<div class="outline-text-4" id="text-2.40">


<p>
Released Aug 1996.
</p>
<ul>
<li>
Upstream changelog must be installed too
</li>
</ul>
</div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Bill Allombert, Josip Rodin, Julian Gilbey, Russ Allbery, and Manoj Srivastava
<a href="mailto:srivasta@debian.org">&lt;srivasta@debian.org&gt;</a>
</p>
<p class="date"> Date: 2009-11-12 17:10:20 PST</p>
<p class="creator">HTML generated by org-mode 6.32b in emacs 23</p>
</div>
</div>
</body>
</html>
